Revit 2024 API
FillPattern.GetFillGrid Method
 Gets the specified fill grid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public FillGrid GetFillGrid(
	int gridIdx
)
Visual Basic
Public Function GetFillGrid ( _
	gridIdx As Integer _
) As FillGrid
Visual C++
public:
FillGrid^ GetFillGrid(
	int gridIdx
)
Parameters
gridIdx
Type: System.Int32
 The index of the fill grid.
Return Value
 The fill grid.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The index of the FillGrid is not valid.
See Also
FillPattern Class
Autodesk.Revit.DB Namespace